const siteData = [
  ﻿[
    {
        "name":  "0 學校課程計畫封面與目錄",
        "pdf":  "pdf_files/0 學校課程計畫封面與目錄.pdf"
    },
    {
        "name":  "0-1學校課程計畫依據與目的",
        "pdf":  "pdf_files/0-1學校課程計畫依據與目的.pdf"
    },
    {
        "name":  "1-1學校現況",
        "pdf":  "pdf_files/1-1學校現況.pdf"
    },
    {
        "name":  "1-2 背景分析",
        "pdf":  "pdf_files/1-2 背景分析.pdf"
    },
    {
        "name":  "2-1學校願景與課程願景",
        "pdf":  "pdf_files/2-1學校願景與課程願景.pdf"
    },
    {
        "name":  "3-1-1總體課程架構",
        "pdf":  "pdf_files/3-1-1總體課程架構.pdf"
    },
    {
        "name":  "3-1-2各年級各領域科目及彈性學習課程名稱與節數安排",
        "pdf":  "pdf_files/3-1-2各年級各領域科目及彈性學習課程名稱與節數安排.pdf"
    },
    {
        "name":  "3-2法律規定教育議題實施規劃",
        "pdf":  "pdf_files/3-2法律規定教育議題實施規劃.pdf"
    },
    {
        "name":  "3-3畢業考後至畢業前課程規劃",
        "pdf":  "pdf_files/3-3畢業考後至畢業前課程規劃.pdf"
    },
    {
        "name":  "4-1-1課程實施說明-各年級各領域科目及各彈性學習課程實施規劃說明",
        "pdf":  "pdf_files/4-1-1課程實施說明-各年級各領域科目及各彈性學習課程實施規劃說明.pdf"
    },
    {
        "name":  "4-1-2課程發展相關組織",
        "pdf":  "pdf_files/4-1-2課程發展相關組織.pdf"
    },
    {
        "name":  "4-1-3教師專業研習及成長活動之規劃",
        "pdf":  "pdf_files/4-1-3教師專業研習及成長活動之規劃.pdf"
    },
    {
        "name":  "4-2課程評鑑規劃",
        "pdf":  "pdf_files/4-2課程評鑑規劃.pdf"
    },
    {
        "name":  "5-1-1-1國語文 ",
        "pdf":  "pdf_files/5-1-1-1國語文 .pdf"
    },
    {
        "name":  "5-1-1-2英語文",
        "pdf":  "pdf_files/5-1-1-2英語文.pdf"
    },
    {
        "name":  "5-1-1-3本土語文-新住民語文-臺灣手語",
        "pdf":  "pdf_files/5-1-1-3本土語文-新住民語文-臺灣手語.pdf"
    },
    {
        "name":  "5-1-1-4數學課程計畫",
        "pdf":  "pdf_files/5-1-1-4數學課程計畫.pdf"
    },
    {
        "name":  "5-1-1-5社會",
        "pdf":  "pdf_files/5-1-1-5社會.pdf"
    },
    {
        "name":  "5-1-1-6自然科學",
        "pdf":  "pdf_files/5-1-1-6自然科學.pdf"
    },
    {
        "name":  "5-1-1-7藝術",
        "pdf":  "pdf_files/5-1-1-7藝術.pdf"
    },
    {
        "name":  "5-1-1-8綜合活動",
        "pdf":  "pdf_files/5-1-1-8綜合活動.pdf"
    },
    {
        "name":  "5-1-1-9生活課程計畫",
        "pdf":  "pdf_files/5-1-1-9生活課程計畫.pdf"
    },
         {
        "name":  "5-1-1-10健體課程計畫",
        "pdf":  "pdf_files/5-1-1-10健體課程計畫.pdf"
    },
    {
        "name":  "5-1-2特殊教育班各年級各領域科目課程計畫",
        "pdf":  "pdf_files/5-1-2特殊教育班各年級各領域科目課程計畫.pdf"
    },
    {
        "name":  "5-2各領域科目課程教學進度表",
        "pdf":  "pdf_files/5-2各領域科目課程教學進度表.pdf"
    },
    {
        "name":  "5-3-1各年級領域科目選用之教科書",
        "pdf":  "pdf_files/5-3-1各年級領域科目選用之教科書.pdf"
    },
    {
        "name":  "6-1各年級彈性學習課程規劃表",
        "pdf":  "pdf_files/6-1各年級彈性學習課程規劃表.pdf"
    },
    {
        "name":  "6-2-1-1彈性學習課程-統整性主題專題議題探究課程",
        "pdf":  "pdf_files/6-2-1-1彈性學習課程-統整性主題專題議題探究課程.pdf"
    },
    {
        "name":  "6-2-1-2彈性學習課程─統整性主題專題議題探究課程",
        "pdf":  "pdf_files/6-2-1-2彈性學習課程─統整性主題專題議題探究課程.pdf"
    },
    {
        "name":  "6-2-1-3彈性學習課程-統整性主題專題議題探究課程",
        "pdf":  "pdf_files/6-2-1-3彈性學習課程-統整性主題專題議題探究課程.pdf"
    },
    {
        "name":  "6-2-1-4彈性學習課程-統整性主題專題議題探究課程",
        "pdf":  "pdf_files/6-2-1-4彈性學習課程-統整性主題專題議題探究課程.pdf"
    },
    {
        "name":  "6-2-1-5彈性學習課程-統整性主題專題議題探究課程",
        "pdf":  "pdf_files/6-2-1-5彈性學習課程-統整性主題專題議題探究課程.pdf"
    },
    {
        "name":  "6-2-1-6彈性學習課程-統整性主題專題議題探究課程",
        "pdf":  "pdf_files/6-2-1-6彈性學習課程-統整性主題專題議題探究課程.pdf"
    },
    {
        "name":  "6-2-3彈性學習課程─特殊需求領域課程",
        "pdf":  "pdf_files/6-2-3彈性學習課程─特殊需求領域課程.pdf"
    },
    {
        "name":  "6-2-4彈性學習課程-其他類課程",
        "pdf":  "pdf_files/6-2-4彈性學習課程-其他類課程.pdf"
    },
    {
        "name":  "6-3融入之議題內容重點",
        "pdf":  "pdf_files/6-3融入之議題內容重點.pdf"
    },
    {
        "name":  "6-4各彈性課程教學進度表",
        "pdf":  "pdf_files/6-4各彈性課程教學進度表.pdf"
    },
    {
        "name":  "6-5彈性學習課程選用教科書自編教材及師資安排表",
        "pdf":  "pdf_files/6-5彈性學習課程選用教科書自編教材及師資安排表.pdf"
    },
    {
        "name":  "6-6在地化課程",
        "pdf":  "pdf_files/6-6在地化課程.pdf"
    },
    {
        "name":  "7-1-1課程發展委員會組織要點",
        "pdf":  "pdf_files/7-1-1課程發展委員會組織要點.pdf"
    },
        {
        "name":  "7-3全校教師授課節數一覽表",
        "pdf":  "pdf_files/7-3全校教師授課節數一覽表.pdf"
    },
    {
        "name":  "7-4-1課程評鑑計畫",
        "pdf":  "pdf_files/7-4-1課程評鑑計畫.pdf"
    },
    {
        "name":  "7-4-2課程評鑑檢核表",
        "pdf":  "pdf_files/7-4-2課程評鑑檢核表.pdf"
    },
    {
        "name":  "7-5 全校學生每日作息時間表",
        "pdf":  "pdf_files/7-5 全校學生每日作息時間表.pdf"
    },
    {
        "name":  "7-6學校年度重大活動行事曆及資源運用",
        "pdf":  "pdf_files/7-6學校年度重大活動行事曆及資源運用.pdf"
    },
    {
        "name":  "7-8校長與教師公開授課實施計畫",
        "pdf":  "pdf_files/7-8校長與教師公開授課實施計畫.pdf"
    },
    {
        "name":  "7-9校外人士協助之部定或校訂課程計畫",
        "pdf":  "pdf_files/7-9校外人士協助之部定或校訂課程計畫.pdf"
    }
    {
        "name":  "7-10雙語融入課程自主檢核表",
        "pdf":  "pdf_files/7-10雙語融入課程自主檢核表.pdf"
    },
]
;
